html/blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-20 Sat 01:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org06fcc31" class="outline-2">
<h2 id="org06fcc31">Blog</h2>
<div class="outline-text-2" id="text-org06fcc31">
</div>
<div id="outline-container-org19d6b60" class="outline-3">
<h3 id="org19d6b60">Writing</h3>
<div class="outline-text-3" id="text-org19d6b60">
</div>
<div id="outline-container-org9e1552d" class="outline-4">
<h4 id="org9e1552d">Formatting</h4>
<div class="outline-text-4" id="text-org9e1552d">
</div>
<div id="outline-container-orgc3c5a54" class="outline-5">
<h5 id="orgc3c5a54">How To Format Units</h5>
<div class="outline-text-5" id="text-orgc3c5a54">
<p>
Italics, spacing, and plurality.
</p>
</div>
</div>
<div id="outline-container-org6000f4f" class="outline-5">
<h5 id="org6000f4f">Fix Your Dangling Paragraphs</h5>
</div>
</div>
<div id="outline-container-orgfa680e4" class="outline-4">
<h4 id="orgfa680e4">Get Rid Of&#x2026;</h4>
<div class="outline-text-4" id="text-orgfa680e4">
</div>
<div id="outline-container-org30726c8" class="outline-5">
<h5 id="org30726c8">Extra Words</h5>
</div>
<div id="outline-container-org131caef" class="outline-5">
<h5 id="org131caef">Backslashes</h5>
</div>
<div id="outline-container-orgb89977b" class="outline-5">
<h5 id="orgb89977b">Clichés</h5>
</div>
<div id="outline-container-org4e52865" class="outline-5">
<h5 id="org4e52865">Filler Words</h5>
</div>
</div>
</div>
<div id="outline-container-org13e50d7" class="outline-3">
<h3 id="org13e50d7">The Significance of Significant Figures</h3>
<div class="outline-text-3" id="text-org13e50d7">
<p>
In the wild I&rsquo;ve come to see three categories of sigfig usage:
</p>
<ol class="org-ol">
<li>No awareness: the author reports values exactly as they were calculated (usually this means to two decimal places) with no regard to context.</li>
<li>Apparent awareness: the author appears to have some awareness of sig figs, but they probably don&rsquo;t have a substantive understanding of why. While decimals are usually not reported, you can tell they lack substantive understanding because they&rsquo;ll still report unnecessary digits with respect to the context (usually the ones digits remains included).</li>
<li>Full awareness: the author reports sig figs correctly and prefixes values to emphasize they are approximated (e.g. 10258 in a relevant range of 0 to 100000 -&gt; &ldquo;about 10000&rdquo;).</li>
</ol>

<p>
You should report sig figs correctly, i.e. with full awareness. To do so you must determine the context of the reported value. As far as I have come up with, this means determining:
</p>
<ol class="org-ol">
<li>The potential range of your reported value.</li>
<li>The resolution necessary to achieve your goal with the value.</li>
</ol>

<p>
<span class="underline">Example 1: Politician&rsquo;s Approval Rating</span>
The range is 0-100%. The necessary resolution depends on the goal. If the goal is to give a lay-TV audience a picture of a politician&rsquo;s standing among the people, probably a 5% resolution is necessary, so reporting values as about 30%, about 35%, about 40%, etc is necessary. If the goal is for a napkin math computation of the percent of the popular vote the politician may receive, probably a 1% resolution is necessary. If the goal is a rigorous computation for a professional pollster, probably a hundredths of a % resolution is necessary.
</p>

<p>
<span class="underline">Example 2: Exam Scores</span>
The range is 0-100 (assume no extra credit). Assume the goal is to compute the class average for your own analysis of how the class is doing. Then probably a 1% resolution is necessary. Assume the average will be used by students to determine their standing relative to classmates. Now we need additional information to determine the context. Namely, we need the range of actual scores, because 1% resolution may not be precise enough to provide meaningful information about relative standing. This would be the case, for example, if the range of scores is between 90 and 91. Let&rsquo;s say the average is 90 (e.g. 90.4, rounded down). Then we have two problems wrto. relative standing: 1) students who got between 90 and the true average (90.4) will think they did better than the reported average (90), even though they actually did worse; 2) distinctions on the scale of tenths or hundredths of points, out of 100, are not useful for comparing relative standing: if you got a 90.5 and I got a 90.6, an average reported to 1% resolution (90) doesn&rsquo;t really help us determine who did better. You will have done 0.555% better than average, and I will have done 0.666% better than average, or 20% better than you. Whereas with the true average (90.4), you will have done only 0.111% better and I will have done 0.221% better, or 100% better than you.
</p>

<p>
Let&rsquo;s say that the range of actual scores is 0 to 100. Then probably a 5% resolution is necessary. If the range is 80 to 100, probably a 1% resolution is necessary. If the range is 80 to 85, probably a tenths or hundredths resolution is necessary.
</p>

<p>
<span class="underline">Example 3: Vehicle Wheelbase</span>
Now we must deal not only with range and resolution with but the contextual relevance of different units. The range is not set by definition, but by empirical data is probably between 2.5m and 3m. Assume the goal is a rough computation of the longitudinal coordinate of the vehicle&rsquo;s center of mass. Then probably a resolution down to the cm is good enough. If we want a rigorous computation, then probably a resolution down to the mm is good enough. However, should we report the value in mm using units of m, cm, or mm? For example, a wheelbase of 2840mm could be conceivably reported as 2.840m, 2.84m, 284.0cm, 284cm, and 2840mm (these are conceivable insofar as no rounding occurs). Using mm puts the reader in a rigorous mindset, and using m or cm down to mm precision can introduce confusion as to whether we have approximate the left sig fig, so mm is probably necessary.
</p>

<p>
<span class="underline">Example 4: Huge Numbers</span>
For huge numbers you can probably drop lots of sig figs because they contribute so little at the large order of magnitude. For example, let&rsquo;s say you do some math and determine that there&rsquo;s 1.0232792349 mol of stars in the universe. A mol is huge, so although you may really want to show your exact value as proof of your rigorous approach, you should probably just report the value as &ldquo;1 mol&rdquo; (or 10<sup>23</sup>). That extra 4.327&#x2026;% of a mol, while large (~10<sup>21</sup>), isn&rsquo;t really useful for communicating the sheer size. A mol is so huge already that adding 10<sup>21</sup> won&rsquo;t affect our mental representation of the quantity.
</p>

<p>
<span class="underline">When to prefix &ldquo;about&rdquo;?</span>
If you&rsquo;ve altered the value enough that it&rsquo;s fairly different from the original. I&rsquo;d prefix about in the following cases taken from the examples:
</p>
<ol class="org-ol">
<li>Approval rating of 43.4% with a goal of informing the audience about the politician&rsquo;s standing relative to a particularly important mark of 47% approval rating. Report as &ldquo;about 40%&rdquo;, because 43% is closer to 40% than it is to 47%, even though if we rounded 43% to 45%, then the rounded value (45%) would be closer to 47% than to 43%.</li>
<li>True average of 72.45. Report as &ldquo;about 70&rdquo; by simple rounding.</li>
<li>Vehicle wheelbase of 2840mm reported in m. Report as &ldquo;about 2.8m&rdquo; because even though we may be using m in a scenario where a casual approximation is suitable, it&rsquo;s good to emphasize that the value is approximate because those extra 40mm do matter.</li>
</ol>
</div>
</div>
<div id="outline-container-org8ff1e36" class="outline-3">
<h3 id="org8ff1e36">Optimizing Humanities for Engineers</h3>
</div>
<div id="outline-container-orgeada0e8" class="outline-3">
<h3 id="orgeada0e8">Don&rsquo;t Call Your FOSS Project Something Unprofessional</h3>
<div class="outline-text-3" id="text-orgeada0e8">
<p>
Please don&rsquo;t call your FOSS tools something unprofessional like &ldquo;Doom Emacs&rdquo;. Note that I am a Doom Emacs user. However, I don&rsquo;t want my Professors wondering why some app on my screen has &ldquo;Doom&rdquo; in the titlebar.
</p>
</div>
</div>
<div id="outline-container-org8f1edbb" class="outline-3">
<h3 id="org8f1edbb">Use Your Car&rsquo;s Parking Brake</h3>
<div class="outline-text-3" id="text-org8f1edbb">
<p>
The parking brake keeps your car exactly where you parked it. The benefits of this include:
</p>
<ul class="org-ul">
<li>Enhanced safety. Your car won&rsquo;t slip, which can be particularly bad in tight parking spaces or if you must get out of the car just after you park.</li>
<li>Determinism. The world is already chaotic enough, might as well make it slightly less so.</li>
</ul>
</div>
</div>
<div id="outline-container-orge943bc7" class="outline-3">
<h3 id="orge943bc7">Units or Acronyms?</h3>
</div>
<div id="outline-container-orgcf57cbb" class="outline-3">
<h3 id="orgcf57cbb">European Bottlecaps</h3>
<div class="outline-text-3" id="text-orgcf57cbb">
<p>
In 2018 the European Parliament initiated the process to regulate bottlecaps for plastic bottles with volume under 3L. The regulation went into effect in 2024. It enumerates a functional requirement that bottlecaps shall remain attached to the bottles. For a primer, read <a href="https://www.corvaglia.com/tethered-caps/">https://www.corvaglia.com/tethered-caps/</a>.
</p>

<p>
The new European bottlecaps have four practical downsides:
</p>
<ol class="org-ol">
<li>The bottlecap has the potential to get in the way, so it requires cognitive load when opening to first observe the resulting orientation and then decide the appropriate course of action. Opening and drinking or pouring from a bottle shouldn&rsquo;t require this type of cognitive load (see 2 and 3 for examples of added cognitive load).</li>
<li>When drinking from the bottle directly they get in your face, which is unpleasant due to the sharp plastic edges of the bottlecap. The course of action to avoid this is to rotate the bottle or rotate the cap. This means using your other hand, unless you feel comfortable rotating the bottle with one hand.</li>
<li>When pouring from the bottle, if the bottlecap attachment ring is loose, the bottlecap rotates due to gravity and gets right in the way of the liquid being poured. So you must hold it aside with another hand.</li>
<li>Sometimes they require more force to open.</li>
</ol>

<p>
The new European bottlecap is associated with X moral downsides:
</p>
<ol class="org-ol">
<li>Government overreach: no inter-national governing body should be able to decide functional requirements for something as trivial bottlecap for member countries.</li>
<li>Useless purpose: I can hardly imagine how keeping bottlecaps attached to bottles with help the environment. Even if it helps a tiny bit, it&rsquo;s still effectively useless with respect to policies such as a carbon tax.</li>
<li>Negative effect for the people: the bottlecaps are badly designed and make quality of life worse.</li>
<li>Government overreach combined with a useless purpose as well as with negative effect for the people: moral downsides 2 and 3 make the government overreach even worse.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf4a0d95" class="outline-3">
<h3 id="orgf4a0d95">Clarifying the Philosophical Foundations of Free Software</h3>
</div>
<div id="outline-container-org252a815" class="outline-3">
<h3 id="org252a815">Practical Tips for Staying Calorie Deficits</h3>
<div class="outline-text-3" id="text-org252a815">
<ol class="org-ol">
<li>If your calorie limit is &lt;2000, have only two meals. They can be bigger, and will be more psychologically rewarding that three smaller meals. Also, eating a small meal can feel limiting and raises temptations. Three smaller meals only amplifies these feelings, so avoid that by having two bigger ones.</li>
<li>If you&rsquo;re doing two meals, use a 1:2 breakfast:dinner calorie ratio. The big dinner will feel rewarding.</li>
<li>Low calorie toppings: spices, soy sauce.</li>
<li>Don&rsquo;t weigh too often, i.e. once a day. Weighing less often, but seeing a bigger weight drop, is more psychologically rewarding. Twice a week could mean seeing a rewarding 2lb drop each weigh-in (2% loss per week at 200lb).</li>
<li>Don&rsquo;t set a limit on eating green vegetables. I don&rsquo;t know the science, but I have a hard time imagining these would cause weight gain, and even slow weight loss. Even if you&rsquo;re doing several hundred calories of greens.</li>
</ol>
</div>
</div>
<div id="outline-container-org2cb30a7" class="outline-3">
<h3 id="org2cb30a7">Safe Driving</h3>
<div class="outline-text-3" id="text-org2cb30a7">
</div>
<div id="outline-container-orgf8a439f" class="outline-4">
<h4 id="orgf8a439f">Quick tips</h4>
<div class="outline-text-4" id="text-orgf8a439f">
<ul class="org-ul">
<li>Two hands on steering wheel at all times</li>
<li>Hands on steering wheel at 2 and 10 o&rsquo;clock positions</li>
<li>Don&rsquo;t drive much over 60 mph</li>
<li>Don&rsquo;t drive over 60 mph in the rain</li>
<li>Stop for a break every 2hrs</li>
<li>Wait a half second at traffic start events when it&rsquo;s your turn to go
<ul class="org-ul">
<li>e.g. traffic light red -&gt; green</li>
</ul></li>
<li>There&rsquo;s no such thing as too much distance to the car ahead of you</li>
<li>Maintain a hard minimum distance to the car ahead of you of 1 car length for every 10 mph</li>
<li>Always assume there&rsquo;s something about to pop out from behind a parked car</li>
<li>Before going at an intersection where you just got green, wait for incoming cars which just got red to stop, or slow down to &lt;10mph</li>
<li>Going an extra few mph won&rsquo;t save much time at all, but it will introduce lots more risk, even at slow speeds
<ul class="org-ul">
<li>i.e. no need to go 25mph (vs 15-20mph) in a city, or 75mph (vs 60mph) on the highway</li>
<li>The time of a short trip (~ a few miles) is dominated by speed-invariant phenomenon, e.g. number of stop lights, so going 15mph instead of 10mph isn&rsquo;t really helping much</li>
<li>The time of a long trip on the highway and on small roads (&gt;10 miles) is dominated by the distance, so a bit more speed saves a bit of time. But, this increase in speed introduces lots of risk: on the highway, 60mph to 70mph is a big risk; on small roads, 30mph to 40mph is a big risk given the frequent twists and turns</li>
</ul></li>
<li>Driving is inherently very risky (though not necessarily statistically dangerous) so there&rsquo;s really no way to guarantee safety, which means you can&rsquo;t get out of these rules</li>
</ul>
</div>
</div>
<div id="outline-container-org84f2afa" class="outline-4">
<h4 id="org84f2afa">Frameworks</h4>
<div class="outline-text-4" id="text-org84f2afa">
</div>
<div id="outline-container-org2f6a0b2" class="outline-5">
<h5 id="org2f6a0b2">Perception as an Event Loop</h5>
<div class="outline-text-5" id="text-org2f6a0b2">
<p>
Accurate, consistent, and frequent perception is critical for safe driving. This perception involves lots of data and moderate to high cognitive load. We can improve consistency, increase frequency, and reduce cognitive load by following an event loop as we drive.
</p>

<p>
The loop:
</p>
<ul class="org-ul">
<li>Check rearview mirror</li>
<li>Check left side mirror</li>
<li>Check right side mirror</li>
</ul>

<p>
Certain events will interrupt our loop, and each event should trigger its own loop:
</p>
<ul class="org-ul">
<li>Lane change
<ul class="org-ul">
<li>Check all mirrors</li>
<li>Check next lane</li>
<li>Verify empty blind spot</li>
<li>Signal</li>
</ul></li>
<li>Other passing
<ul class="org-ul">
<li>Verify that other car&rsquo;s speed and velocity are nominal</li>
<li>Estimate if other car&rsquo;s distance will be too close</li>
<li>Verify that distance is enough as the car is passing</li>
</ul></li>
</ul>

<p>
More difficult things to add to the loop:
</p>
<ul class="org-ul">
<li>Track distance to the car behind you (tailgate, moderate, or long)</li>
<li>Path planning of cars around you</li>
<li>For each lane left and right of you, maintain binary values for can/cannot do a quick lane change evasive maneuver into that lane</li>
</ul>
</div>
</div>
<div id="outline-container-orgc66fe70" class="outline-5">
<h5 id="orgc66fe70">Slower = Safer</h5>
</div>
<div id="outline-container-orgdcd3647" class="outline-5">
<h5 id="orgdcd3647">Predict the Paths of Other Vehicles</h5>
<div class="outline-text-5" id="text-orgdcd3647">
<p>
If you can predict the paths of other vehicles you&rsquo;ll be better prepared to react if something goes wrong with them. This is particularly useful:
</p>
<ul class="org-ul">
<li>At highway speeds</li>
<li>When other vehicles switch lanes</li>
<li>At complex intersections</li>
</ul>
</div>
</div>
<div id="outline-container-org7ecbd59" class="outline-5">
<h5 id="org7ecbd59">Optimizing Cognitive Load for Long Drives</h5>
<div class="outline-text-5" id="text-org7ecbd59">
<p>
Unfortunately, employing all the tips and frameworks described here requires high cognitive effort. This makes long drives difficult (&gt; 15 minutes, in my experience). Thus, we should optimize which tips and frameworks to leave out.
</p>
<ul class="org-ul">
<li>When there&rsquo;s no pedestrians or other vehicles around, you can ease up on exteroception</li>
<li>At slow (&lt;20 mph) speeds, you can use less precise path planning and control</li>
<li>At stop lights you can physically relax</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:lorenzohess@tutanota.com">lorenzohess@tutanota.com</a></p>
<p class="date">Created: 2025-12-20 Sat 01:05</p>
</div>
</body>
</html>
